bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    // Calculate the number of color channels based on LED type
    uint32_t colorCount = CalculateColorCount(this->controller->LedType);

    // Set the color values directly using a generic function
    result = SetDutyCycleGeneric(this, dutyCycleValues, colorCount);

    if (result != LED_STATUS_SUCCESS)
    {
        // Stop the animation if an error occurred
        if (this->callback != NULL)
        {
            this->callback(this->animationType, result);
        }
        this->animationType = LED_ANIMATION_TYPE_NONE;
    }

    return result;
}

/**
 * @brief Handles the repeat logic for the LED animation.
 *
 * This function decrements the repeat times for the LED animation and checks if the animation has
 * completed. If the repeat times reach zero, the function stops the animation and calls the
 * registered callback function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param PatternRepeatTimes The number of times the pattern should repeat. If set to -1, the
 * pattern repeats indefinitely.
 * @param StopOnCompletion Flag to indicate if the animation should stop when it completes.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or
 * LED_ANIMATION_COMPLETED if the animation has completed.
 */
static LED_Status_t HandleRepeatLogic(LED_Handle_t* this, int32_t PatternRepeatTimes, bool StopOnCompletion)
{
    if (PatternRepeatTimes != -1)
    {
        this->repeatTimes--;
        LED_CONTROL_DBG_MSG("Repeat Times: %d\r\n", this->repeatTimes);
    }
    if (this->repeatTimes == 0)
    {
        this->isRunning = false;
        if (this->callback != NULL)
        {
            this->callback(this->animationType, LED_STATUS_ANIMATION_COMPLETED);
        }

        if (StopOnCompletion)
        {
            this->controller->Stop();
        }

        return LED_STATUS_ANIMATION_COMPLETED;
    }
    return LED_STATUS_SUCCESS;
}

/**
 * @brief Validates the LED controller structure for the animation.
 *
 * This function checks the LED controller structure for the animation to ensure that all required
 * function pointers are not NULL. It also validates the LED type to ensure that it is a valid LED
 * type.
 *
 * @param Controller Pointer to the LED_Controller_t structure to validate.
 * @return LED_Status_t The status of the validation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_AnimationValidateController(LED_Controller_t* Controller)
{
    if (Controller == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }
    if (Controller->Start == NULL || Controller->Stop == NULL || Controller->PwmConfig == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }
    if (!IS_VALID_LED_TYPE(Controller->LedType))
    {
        return LED_STATUS_ERROR_INVALID_LED_TYPE;
    }
    return LED_STATUS_SUCCESS;
}

/**
 * @brief Initializes the LED animation structure.
 *
 * This function initializes the LED animation structure with the provided LED controller and
 * callback function. It sets the animation type to LED_ANIMATION_TYPE_NONE and the animation data to
 * NULL.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Controller Pointer to the LED_Controller_t structure representing the LED controller.
 * @param callback Callback function to call when the animation completes.
 * @return LED_Status_t The status of the initialization. Returns LED_STATUS_SUCCESS if successful, or an
 * error code if an error occurred.
 */
LED_Status_t
LED_Animation_Init(LED_Handle_t* this, LED_Controller_t* Controller, LED_Animation_Complete_Callback callback)
{
    if (this == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    LED_Status_t status = LED_AnimationValidateController(Controller);
    if (status != LED_STATUS_SUCCESS)
    {
        return status;
    }

    this->controller    = Controller;
    this->animationType = LED_ANIMATION_TYPE_NONE;
    this->animationData = NULL;
    this->isRunning     = false;
    this->startTime     = 0;
    this->callback      = callback;

#if USE_LED_ANIMATION_SINE_APPROX
    update_exp_multiplier_factor();
#endif
    LED_CONTROL_DBG_MSG("LED Animation Initialized, LED type = %d\r\n", this->controller->LedType);

    return LED_STATUS_SUCCESS;
}

/**
 * @brief Starts the LED animation.
 *
 * This function starts the LED animation by setting the isRunning flag to true and the start time
 * to 0.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Start(LED_Handle_t* this)
{
    LED_Status_t status = LED_STATUS_SUCCESS;

    if (this == NULL)
    {
        status = LED_STATUS_ERROR_NULL_POINTER;
    }

    this->isRunning = true;
    this->startTime = 0;

    if (this->callback != NULL)
    {
        this->callback(this->animationType, LED_STATUS_ANIMATION_STARTED);
    }

    LED_CONTROL_DBG_MSG("LED Animation Started\r\n");

    return status;
}

/**
 * @brief Stops the LED animation.
 *
 * This function stops the LED animation by setting the isRunning flag to false.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Stop(LED_Handle_t* this, bool leaveLastColor)
{
    LED_Status_t status = LED_STATUS_SUCCESS;

    if (this == NULL)
    {
        status = LED_STATUS_ERROR_NULL_POINTER;
    }

    // if the animation is running and the callback is not null, call the callback
    if (this->isRunning && this->callback != NULL)
    {
        this->callback(this->animationType, LED_STATUS_ANIMATION_STOPPED);
    }

    if (!leaveLastColor)
    {
        // Set the LED to off state
        this->controller->Stop();
    }

    this->isRunning = false;
    LED_CONTROL_DBG_MSG("LED Animation Stopped\r\n");

