bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    return status;
}

/**
 * @brief Updates the LED animation based on the current tick value.
 *
 * This function updates the LED animation based on the current tick value. It executes the
 * animation based on the animation type and the provided animation data. If an error occurs during
 * the animation execution, it stops the animation and calls the registered callback function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param tick The current tick value for the animation in ms.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Update(LED_Handle_t* this, uint32_t tick)
{
    LED_Status_t status = LED_STATUS_SUCCESS;

    // update only if tick has changed since last update call
    if (this->lastTick == tick)
    {
        return LED_STATUS_SUCCESS;
    }

    if (this == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    if (IS_VALID_LED_ANIMATION_TYPE(this->animationType) == false)
    {
        return LED_STATUS_ERROR_INVALID_ANIMATION_TYPE;
    }

    switch (this->animationType)
    {
    case LED_ANIMATION_TYPE_NONE:
        status = LED_AnimationNoneExecute(this);
        break;
    case LED_ANIMATION_TYPE_OFF:
        status = LED_AnimationOffExecute(this);
        break;
    case LED_ANIMATION_TYPE_SOLID:
        status = LED_AnimationSolidExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_FLASH:
        status = LED_AnimationFlashExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_BLINK:
        status = LED_AnimationBlinkExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_BREATH:
        status = LED_AnimationBreathExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_FADE_IN:
        status = LED_AnimationFadeInExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_FADE_OUT:
        status = LED_AnimationFadeOutExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_PULSE:
        status = LED_AnimationPulseExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_ALTERNATING_COLORS:
        status = LED_AnimationAlternatingColorsExecute(this, tick);
        break;
    case LED_ANIMATION_TYPE_COLOR_CYCLE:
        status = LED_AnimationColorCycleExecute(this, tick);
        break;
    default:
        break;
    }

    this->lastTick = tick;
    return status;
}

/**
 * @brief Executes the LED animation for the LED_ANIMATION_TYPE_NONE type.
 *
 * This function executes the LED animation for the LED_ANIMATION_TYPE_NONE type, which is a no-op
 * function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
static LED_Status_t LED_AnimationNoneExecute(LED_Handle_t* this)
{
    return LED_STATUS_SUCCESS;
}

/**
 * @brief Sets the LED animation to the off state.
 *
 * This function sets the LED animation to the off state by setting the animation type to
 * LED_ANIMATION_TYPE_OFF and the animation data to NULL.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetOff(LED_Handle_t* this)
{

    if (this == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_OFF;
    this->animationData = NULL;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Off\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationOffExecute(LED_Handle_t* this)
{
    if (this == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    if (this->isRunning == false)
    {
        return LED_STATUS_SUCCESS;
    }

    this->controller->Stop();
    this->isRunning = false;

    if (this->callback != NULL)
    {
        this->callback(this->animationType, LED_STATUS_SUCCESS);
        this->animationType = LED_ANIMATION_TYPE_NONE;
    }

    return LED_STATUS_SUCCESS;
}

/**
 * @brief Sets the LED animation to the solid state.
 *
 * This function sets the LED animation to the solid state by setting the animation type to
 * LED_ANIMATION_TYPE_SOLID and the animation data to the provided Solid color.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Solid Pointer to the LED_Animation_Solid_t structure representing the solid color
 * animation.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetSolid(LED_Handle_t* this, LED_Animation_Solid_t* Solid)
{
    if (this == NULL || Solid == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_SOLID;
    this->animationData = Solid;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Solid\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationSolidExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    LED_Animation_Solid_t* Solid = (LED_Animation_Solid_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_STATUS_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime = tick;
        this->controller->Start();

        // Execute color only once
        LED_Status_t result = LED_Animation_ExecuteColorSetting(this, (uint8_t*)Solid->color);

        if (result != LED_STATUS_SUCCESS)
        {
            return result;
        }
    }

    // Check if the execution time has elapsed
    uint32_t elapsedTime = tick - this->startTime;
    if (Solid->executionTimeMs > 0 && elapsedTime >= Solid->executionTimeMs)
    {
        this->isRunning = false;
        this->controller->Stop();

        if (this->callback != NULL)
        {
            this->callback(this->animationType, LED_STATUS_ANIMATION_COMPLETED);
        }
    }

    return LED_STATUS_SUCCESS;
}

/**
 * @brief Sets the LED animation to the flash state.
 *
 * This function sets the LED animation to the flash state by setting the animation type to
 * LED_ANIMATION_TYPE_FLASH and the animation data to the provided Flash color.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Flash Pointer to the LED_Animation_Flash_t structure representing the flash color
 * animation.
 * @return LED_Status_t The status of the operation. Returns LED_STATUS_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetFlash(LED_Handle_t* this, LED_Animation_Flash_t* Flash)
{
    if (this == NULL || Flash == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

