bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
#define PI 3.14159
#define PI_HALF (PI / 2)
#define EXP_MULTIPLIER 3

// Approximate sine function using a polynomial approximation for sine in the range [0, PI/2]
// sin(x) ≈ x - (x^3 / 6) + (x^5 / 120)
static inline float fast_sine(float x)
{
    float x2 = x * x;
    float x3 = x2 * x;
    float x5 = x3 * x2;
    return x - (x3 / 6) + (x5 / 120);
}

// Precomputed exponential value for EXP_MULTIPLIER
// approximately exp(3) - 1
float EXP_MULTIPLIER_FACTOR = 19.0855f;

static inline float fast_exp(float x)
{
    // Use a polynomial approximation for exponential function
    return 1 + x + (x * x / 2) + (x * x * x / 6);
}

static void update_exp_multiplier_factor()
{
    float maxExpInput     = fast_exp(fast_sine(PI_HALF) * EXP_MULTIPLIER);
    EXP_MULTIPLIER_FACTOR = maxExpInput - 1;

    LED_CONTROL_DBG_MSG("Factor: %ld\r\n", (long)(EXP_MULTIPLIER_FACTOR * 1000));
}

static uint32_t GetFadeBrightnessSineAprox(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress ranging from 0.0 to 1.0
    float progress = (float)elapsed / duration;

    float sineInput;
    if (isFadingIn)
    {
        // Rise phase
        sineInput = fast_sine(progress * PI_HALF); // Approx. sine wave from 0 to PI/2 (0 to 1)
    }
    else
    {
        // Fall phase
        sineInput = fast_sine((1 - progress) * PI_HALF); // Approx. sine wave from PI/2 to 0 (1 to 0)
    }

    float    expInput   = fast_exp(sineInput * EXP_MULTIPLIER);
    uint32_t brightness = (uint32_t)((expInput - 1) / EXP_MULTIPLIER_FACTOR * maxDutyCycle);

    // Ensure that brightness does not exceed maxDutyCycle
    if (brightness > maxDutyCycle)
    {
        brightness = maxDutyCycle;
    }

    return brightness;
}
#endif

static uint32_t GetBreathBrightness(uint32_t timeInCycle, LED_Animation_Breath_t* Breath, uint32_t maxDutyCycle)
{
    // Calculate the total duration of one full breath cycle in milliseconds.
    uint32_t totalCycleTimeMs = Breath->riseTimeMs + Breath->fallTimeMs;

    // Get the duration of the rising phase of the breath cycle from the animation parameters.
    uint32_t riseTimeMs = Breath->riseTimeMs;

    uint32_t Brightness;

    // Determine the current phase of the cycle (rising or falling) and calculate brightness
    // accordingly.
    if (timeInCycle < riseTimeMs)
    {
        bool fadeDir = Breath->invert ? false : true;
        Brightness   = CalculateFadeBrightness(timeInCycle, riseTimeMs, maxDutyCycle, fadeDir);
    }
    else
    {
        bool fadeDir = Breath->invert ? true : false;
        Brightness   = CalculateFadeBrightness(timeInCycle - riseTimeMs, Breath->fallTimeMs, maxDutyCycle, fadeDir);
    }

    return Brightness;
}

static LED_Status_t LED_AnimationBreathExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    if (!this->isRunning)
    {
        return LED_STATUS_SUCCESS;
    }

    LED_Animation_Breath_t* Breath = (LED_Animation_Breath_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = Breath->repeatTimes;
        this->controller->Start();
    }

    uint32_t elapsedTime      = tick - this->startTime;
    uint32_t totalCycleTimeMs = Breath->riseTimeMs + Breath->fallTimeMs;
    uint32_t timeInCycle      = elapsedTime % totalCycleTimeMs;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);
    uint16_t dutyCycleValues[colorCount];

    // Calculate the maximum duty cycle based on the maximum brightness level of  the LED.

    for (uint32_t i = 0; i < colorCount; i++)
    {
        uint32_t maxDutyCycle =
            BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(Breath->color))[i], this->controller->MaxDutyCycle);

        dutyCycleValues[i] = GetBreathBrightness(timeInCycle, Breath, maxDutyCycle);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != timeInCycle && i == 0)
        {
            lastElapsedTime = timeInCycle;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", timeInCycle, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_STATUS_SUCCESS)
    {
        return result;
    }

    if (elapsedTime >= totalCycleTimeMs)
    {
        this->startTime       = tick;
        bool StopOnCompletion = Breath->invert ? false : true;
        HandleRepeatLogic(this, Breath->repeatTimes, StopOnCompletion);
    }

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetFadeIn(LED_Handle_t* this, LED_Animation_FadeIn_t* FadeIn)
{
    if (this == NULL || FadeIn == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_FADE_IN;
    this->animationData = FadeIn;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation FadeIn\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationFadeInExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }
    if (!this->isRunning)
    {
        return LED_STATUS_SUCCESS;
    }

    LED_Animation_FadeIn_t* FadeIn = (LED_Animation_FadeIn_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = FadeIn->repeatTimes;
        LED_CONTROL_DBG_MSG("Repeat times: %d\r\n", FadeIn->repeatTimes);
        this->controller->Start();
    }

    uint32_t elapsedTime = tick - this->startTime;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);
    uint16_t dutyCycleValues[colorCount];
    for (uint32_t i = 0; i < colorCount; i++)
    {
        // Calculate the maximum duty cycle based on the maximum brightness level of the LED.
        uint32_t maxDutyCycle =
            BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(FadeIn->color))[i], this->controller->MaxDutyCycle);
        uint32_t start_cycles, end_cycles, total_cycles;

        dutyCycleValues[i] = CalculateFadeBrightness(elapsedTime, FadeIn->durationMs, maxDutyCycle, true);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != elapsedTime && i == 0)
        {
            lastElapsedTime = elapsedTime;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", elapsedTime, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_STATUS_SUCCESS)
    {
        return result;
    }

    if (elapsedTime >= FadeIn->durationMs)
    {
        HandleRepeatLogic(this, FadeIn->repeatTimes, false);
        this->startTime = tick;
    }

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetFadeOut(LED_Handle_t* this, LED_Animation_FadeOut_t* FadeOut)
{
    if (this == NULL || FadeOut == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_FADE_OUT;
    this->animationData = FadeOut;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation FadeOut\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationFadeOutExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }
    if (!this->isRunning)
    {
        return LED_STATUS_SUCCESS;
    }

    LED_Animation_FadeIn_t* FadeOut = (LED_Animation_FadeOut_t*)this->animationData;

